In [2]:
from fastai.learner import *
from fastai.column_data import *

In [3]:
PATH=Path('../data/elo')

In [4]:
customer = pd.read_csv(PATH/'train.csv')

In [5]:
len(customer)

201917

In [101]:
customer_test = pd.read_csv(PATH/'test.csv')

In [62]:
customer.head()

,first_active_month,card_id,feature_1,feature_2,feature_3,target
0,2017-06,C_ID_92a2005557,5,2,1,-0.820283
1,2017-01,C_ID_3d0044924f,4,1,0,0.392913
2,2016-08,C_ID_d639edf6cd,2,2,0,0.688056
3,2017-09,C_ID_186d6a6901,4,3,0,0.142495
4,2017-11,C_ID_cdbd2c0db2,1,3,0,-0.159749

In [39]:
customer_id = customer.groupby(['first_active_month','feature_1','feature_2','feature_3'],as_index=False).count().reset_index()

In [106]:
customer_test_id = customer_test.groupby(['first_active_month','feature_1','feature_2','feature_3'],as_index=False).count().reset_index()

In [107]:
customer_test_id = customer_test_id[['index','first_active_month','feature_1','feature_2','feature_3']].copy()
len(customer_test_id)

487

In [115]:
check = pd.merge(customer_id, customer_test_id,how='outer',on=['first_active_month','feature_1','feature_2','feature_3'])

In [114]:
# check =check.dropna(inplace=True)
check.head()

   index_x first_active_month  feature_1  feature_2  feature_3  index_y
0        0            2011-11          3          1          1        0
1        2            2011-12          3          1          1        1
2        3            2012-02          3          1          1        4
3        4            2012-02          3          3          1        5
4        5            2012-03          3          1          1        6

In [116]:
len(check)

510

In [49]:
customer_id = customer_id[['index','first_active_month','feature_1','feature_2','feature_3']].copy()
customer_id.head()
# customer_id = customer_id.drop(['card_id','target'],inplace=True)

   index first_active_month  feature_1  feature_2  feature_3
0      0            2011-11          3          1          1
1      1            2011-11          3          3          1
2      2            2011-12          3          1          1
3      3            2012-02          3          1          1
4      4            2012-02          3          3          1

In [99]:
len(customer_id)

495

In [100]:
len(customer)

201917

In [7]:
merchants =  pd.read_csv(PATH/'merchants.csv')

In [8]:
merchants.head()

,merchant_id,merchant_group_id,merchant_category_id,subsector_id,numerical_1,numerical_2,category_1,most_recent_sales_range,most_recent_purchases_range,avg_sales_lag3,...,avg_sales_lag6,avg_purchases_lag6,active_months_lag6,avg_sales_lag12,avg_purchases_lag12,active_months_lag12,category_4,city_id,state_id,category_2
0,M_ID_838061e48c,8353,792,9,-0.057471,-0.057471,N,E,E,-0.40,...,-2.25,18.666667,6,-2.32,13.916667,12,N,242,9,1.0
1,M_ID_9339d880ad,3184,840,20,-0.057471,-0.057471,N,E,E,-0.72,...,-0.74,1.291667,6,-0.57,1.687500,12,N,22,16,1.0
2,M_ID_e726bbae1e,447,690,1,-0.057471,-0.057471,N,E,E,-82.13,...,-82.13,260.000000,2,-82.13,260.000000,2,N,-1,5,5.0
3,M_ID_a70e9c5f81,5026,792,9,-0.057471,-0.057471,Y,E,E,NaN,...,NaN,4.666667,6,NaN,3.833333,12,Y,-1,-1,NaN
4,M_ID_64456c37ce,2228,222,21,-0.057471,-0.057471,Y,E,E,NaN,...,NaN,0.361111,6,NaN,0.347222,12,Y,-1,-1,NaN

In [90]:
len(merchants)

334696

In [95]:
merchant_id = merchants.groupby(['merchant_group_id','state_id','city_id'],as_index=False).count().reset_index()

In [96]:
# merchant_id = merchant_id[['index','merchant_group_id','merchant_category_id','subsector_id','city_id','state_id']].copy()
merchant_id = merchant_id[['index','merchant_group_id','state_id','city_id']].copy()

In [97]:
merchant_id.head()

   index  merchant_group_id  state_id  city_id
0      0                  1        16       51
1      1                  2         4       52
2      2                  2        20       -1
3      3                  2        21       -1
4      4                  3         4      114

In [98]:
len(merchant_id)

244731

In [9]:
new_merchants =  pd.read_csv(PATH/'new_merchant_transactions.csv')
merchants.head()

,merchant_id,merchant_group_id,merchant_category_id,subsector_id,numerical_1,numerical_2,category_1,most_recent_sales_range,most_recent_purchases_range,avg_sales_lag3,...,avg_sales_lag6,avg_purchases_lag6,active_months_lag6,avg_sales_lag12,avg_purchases_lag12,active_months_lag12,category_4,city_id,state_id,category_2
0,M_ID_838061e48c,8353,792,9,-0.057471,-0.057471,N,E,E,-0.40,...,-2.25,18.666667,6,-2.32,13.916667,12,N,242,9,1.0
1,M_ID_9339d880ad,3184,840,20,-0.057471,-0.057471,N,E,E,-0.72,...,-0.74,1.291667,6,-0.57,1.687500,12,N,22,16,1.0
2,M_ID_e726bbae1e,447,690,1,-0.057471,-0.057471,N,E,E,-82.13,...,-82.13,260.000000,2,-82.13,260.000000,2,N,-1,5,5.0
3,M_ID_a70e9c5f81,5026,792,9,-0.057471,-0.057471,Y,E,E,NaN,...,NaN,4.666667,6,NaN,3.833333,12,Y,-1,-1,NaN
4,M_ID_64456c37ce,2228,222,21,-0.057471,-0.057471,Y,E,E,NaN,...,NaN,0.361111,6,NaN,0.347222,12,Y,-1,-1,NaN

In [10]:
transactions= pd.read_csv(PATH/'historical_transactions.csv',nrows=10000)
transactions.head()

,authorized_flag,card_id,city_id,category_1,installments,category_3,merchant_category_id,merchant_id,month_lag,purchase_amount,purchase_date,category_2,state_id,subsector_id
0,Y,C_ID_4e6213e9bc,88,N,0,A,80,M_ID_e020e9b302,-8,-0.703331,2017-06-25 15:33:07,1.0,16,37
1,Y,C_ID_4e6213e9bc,88,N,0,A,367,M_ID_86ec983688,-7,-0.733128,2017-07-15 12:10:45,1.0,16,16
2,Y,C_ID_4e6213e9bc,88,N,0,A,80,M_ID_979ed661fc,-6,-0.720386,2017-08-09 22:04:29,1.0,16,37
3,Y,C_ID_4e6213e9bc,88,N,0,A,560,M_ID_e6d5ae8ea6,-5,-0.735352,2017-09-02 10:06:26,1.0,16,34
4,Y,C_ID_4e6213e9bc,88,N,0,A,80,M_ID_e020e9b302,-11,-0.722865,2017-03-10 01:14:19,1.0,16,37

In [53]:
transactions[transactions['purchase_amount'] > 0]['merchant_id'].count()

230

In [60]:
total_cust_trans = transactions.groupby(['card_id','merchant_id']
          )['purchase_amount'].sum().reset_index().copy()

In [61]:
total_custs = total_cust_trans.groupby(['card_id'])['purchase_amount'].sum().reset_index().copy()
total_merchants = total_cust_trans.groupby(['merchant_id'])['purchase_amount'].sum().reset_index().copy()

User - Rating model
Merchants are same as movies - if customer bought from that merchant - give rating based on number of times (purchase from merchant /total purchases )
Use customer features 1,2,3 and target  
use merchant ratings for that customer
use historical transactions to extract features about merchant rating given by the customer (based on type of customer, first active month, feature 1,2,3
Card_id is not a feature

Categorize merchants by merchant_group_id	merchant_category_id	subsector_id,city,state

Test set do not have merchant feature, so target for customer would be 
1) average of all merchants
2) sum of all merchants
3) sum of top 10 merchants 
4) average of top 10 merchants

In [12]:
df_test =  pd.read_csv(PATH/'test.csv')
df_test.head()

  first_active_month          card_id  feature_1  feature_2  feature_3
0            2017-04  C_ID_0ab67a22ab          3          3          1
1            2017-01  C_ID_130fd0cbdd          2          3          0
2            2017-08  C_ID_b709037bc5          5          1          1
3            2017-12  C_ID_d27d835a9f          2          1          0
4            2015-12  C_ID_2b5e3df5c2          5          1          1

In [84]:
# frames = [customer,total_custs]
# cust_result = pd.concat(frames,axis=1, join_axes=[customer.card_id],join='outer')
cust_result = pd.merge(customer,total_custs, how='outer',on='card_id',left_index=True)

cust_result.head()

,first_active_month,card_id,feature_1,feature_2,feature_3,target,purchase_amount
36,2017-06,C_ID_92a2005557,5.0,2.0,1.0,-0.820283,NaN
36,2017-01,C_ID_3d0044924f,4.0,1.0,0.0,0.392913,NaN
36,2016-08,C_ID_d639edf6cd,2.0,2.0,0.0,0.688056,NaN
36,2017-09,C_ID_186d6a6901,4.0,3.0,0.0,0.142495,NaN
36,2017-11,C_ID_cdbd2c0db2,1.0,3.0,0.0,-0.159749,NaN

In [85]:
cust_result[cust_result['purchase_amount'] > 0]

,first_active_month,card_id,feature_1,feature_2,feature_3,target,purchase_amount
5,2016-06,C_ID_198914cf94,5.0,2.0,1.0,1.775911,10836.225418

In [86]:
len(cust_result)

201928

In [87]:
len(customer)

201917